nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 1, AIFB, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 1, AIFB, [256]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 1, AIFB, [384]]
  - [-1, 1, Conv, [384, 3, 2]]
  - [-1, 3, AIFB, [384]]


head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, ASAM, [1024]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [128, 1, 1]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [2, 1, SPDConv, [128]]
  - [[-1, -2, 4], 1, Concat, [1]]
  - [[-1, 6], 1, CAFM, [256, 2, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]